# ============================================
# Brewfile.tools - 工具包 (开发增强)
# ============================================
# 频繁使用的开发工具
# 用法: brew bundle --file=brew/Brewfile.tools

# ============================================
# 语言工具
# ============================================
brew "python@3.14"      # Python 3.14
brew "pyenv"            # Python 版本管理

# ============================================
# 数据库工具
# ============================================
brew "pgcli"            # PostgreSQL CLI

# ============================================
# 系统监控
# ============================================
brew "htop"             # 系统监控
brew "btop"             # 更现代的 htop
brew "glances"          # 系统监控

# ============================================
# 终端工具
# ============================================
brew "asciinema"        # 终端录制
brew "zellij"           # 现代终端复用器
brew "tldr"             # 简化版 man
brew "tree"             # 树状显示

# ============================================
# HTTP/API 工具
# ============================================
brew "httpie"           # HTTP 客户端

# ============================================
# AI/LLM 工具
# ============================================
brew "ollama"           # 本地 LLM
brew "opencode"         # AI 辅助编码

# ============================================
# 开发工具
# ============================================
brew "golangci-lint"    # Go linter

# ============================================
# Casks - 开发工具
# ============================================
cask "orbstack"         # Docker 替代
cask "warp"             # AI 终端
