# Brewfile - Homebrew 包管理清单
# 用法: brew bundle [--file=Brewfile]
#
# 按 Ctrl+H 显示帮助

# ============================================
# Shell 核心 (Shell Core)
# ============================================
brew "zsh"
brew "bash"
brew "starship"         # 跨 shell 提示符

# ============================================
# Shell 框架与优化 (Shell Framework)
# ============================================
brew "zimfw"            # 快速 Zsh 框架
brew "fzf"              # 模糊查找器

# ============================================
# 现代命令行工具 (Modern CLI Tools)
# ============================================
brew "atuin"            # 命令历史搜索 (Ctrl+R)
brew "zoxide"           # 智能目录跳转 (z)
brew "direnv"           # 项目环境自动加载

# ============================================
# 文件操作 (File Operations)
# ============================================
brew "eza"              # 现代 ls (带图标)
brew "bat"              # 现代 cat (语法高亮)
brew "ripgrep"          # 快速搜索 (rg)
brew "fd"               # 快速查找 (fd)
brew "tree"             # 树状显示
brew "dust"             # 现代 du

# ============================================
# Git 工具 (Git Tools)
# ============================================
brew "git"
brew "lazygit"          # Git TUI
brew "gh"               # GitHub CLI
brew "git-delta"        # 现代 diff 查看

# ============================================
# 编辑器 (Editors)
# ============================================
brew "neovim"           # 现代 Vim
brew "vim"

# ============================================
# 开发工具 (Development Tools)
# ============================================
brew "go"               # Go 语言
brew "node"             # Node.js
brew "python@3.14"      # Python 3.14
brew "pyenv"            # Python 版本管理
brew "fnm"              # Node 版本管理

# ============================================
# 数据工具 (Data Tools)
# ============================================
brew "jq"               # JSON 处理
brew "yq"               # YAML 处理
brew "httpie"           # HTTP 客户端

# ============================================
# 数据库工具 (Database Tools)
# ============================================
brew "pgcli"            # PostgreSQL CLI
brew "litecli"          # SQLite CLI

# ============================================
# 系统监控 (System Monitoring)
# ============================================
brew "htop"             # 系统监控
brew "btop"             # 更现代的 htop
brew "glances"          # 系统监控
brew "asciinema"        # 终端录制

# ============================================
# 终端复用器 (Terminal Multiplexers)
# ============================================
brew "zellij"           # 现代终端复用器

# ============================================
# AI/LLM 工具 (AI/LLM Tools)
# ============================================
brew "ollama"           # 本地 LLM
brew "opencode"         # AI 辅助编码

# ============================================
# 网络工具 (Network Tools)
# ============================================
brew "wget"
brew "curl"
brew "tldr"             # 简化版 man

# ============================================
# Casks - GUI 应用程序
# ============================================
cask "iterm2"           # 终端
cask "ghostty"          # 现代终端
cask "warp"             # AI 终端
cask "orbstack"         # Docker 替代
cask "font-jetbrains-mono-nerd-font"  # 字体

# ============================================
# 开发工具 Casks
# ============================================
cask "claude-code"      # Claude Code
cask "rstudio"          # R Studio
cask "cc-switch"        # 清华身份验证

# ============================================
# 其他工具 Casks
# ============================================
cask "flux-app"         # 护眼
cask "chatwise"         # WhatsApp
cask "royal-tsx"        # Royal TSX
cask "termius"          # SSH 客户端
