# ============================================
# Brewfile.core - 核心包 (必需)
# ============================================
# 每日使用，无之不可
# 用法: brew bundle --file=brew/Brewfile.core

tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/core"

# ============================================
# Shell 核心
# ============================================
brew "zsh"
brew "starship"         # 跨 shell 提示符

# ============================================
# Shell 框架
# ============================================
brew "zimfw"            # 快速 Zsh 框架
brew "fzf"              # 模糊查找器

# ============================================
# 现代命令行工具 (核心)
# ============================================
brew "atuin"            # 命令历史搜索 (Ctrl+R)
brew "zoxide"           # 智能目录跳转 (z)
brew "direnv"           # 项目环境自动加载

# ============================================
# 文件操作 (现代替代)
# ============================================
brew "eza"              # 现代 ls (带图标)
brew "bat"              # 现代 cat (语法高亮)
brew "ripgrep"          # 快速搜索 (rg)
brew "fd"               # 快速查找 (fd)

# ============================================
# Git 工具
# ============================================
brew "git"
brew "lazygit"          # Git TUI
brew "gh"               # GitHub CLI

# ============================================
# 编辑器
# ============================================
brew "neovim"           # 现代编辑器

# ============================================
# 开发语言
# ============================================
brew "go"               # Go
brew "node"             # Node.js
brew "fnm"              # Node 版本管理

# ============================================
# 数据工具
# ============================================
brew "jq"               # JSON 处理
brew "yq"               # YAML 处理

# ============================================
# 网络
# ============================================
brew "wget"
brew "curl"

# ============================================
# Casks - 核心应用
# ============================================
cask "iterm2"           # 终端
cask "ghostty"          # 现代终端
cask "font-jetbrains-mono-nerd-font"  # 字体
cask "claude-code"      # Claude Code
